//Тесты
// 1)
//какие типы встроенных всплывающих окон в js вы знаете?
//alert(), confirm(), prompt()

// 2)
//выведите всплывающее окно с предупреждением 'Осторожно'
//alert('Остoрожно!')

// 3)
//выведите всплывающее окно с кнопками подтверждения и отмены
// 

// 4)
//выведите всплывающее окно с вопросом и возможностью записать ответ
// 

// 5)
//какое временное событие выполняется после ожидания указанного количества миллисекунд?
//setTimeOut()

// 6)
//какое временное событие непрерывно повторяет выполнение функции?
//setInterval()

// 7)
//выведите в консоли сообщение 'НАЧАЛО' с помощью setTimeout
setTimeout(() => {
    console.log('Начало')
}, 1)

// 8)
//выведите в консоли сообщение 'ПОВТОР' с помощью setInterval каждые 2 секунды
setInterval(() => {
    console.log('Повтор')
}, 2000)

// 9)
//что такое куки?
// Данные, которые хранятся в компьютере в небольших текстовых файлах.

// 10)
//как создать куки файл?
// document.cookie() = 

// 11)
//как изменить ранее записанный куки?
// document.cookie() =

// 12)
//как удалить ранее записанный куки?
//Указать в expires уже прошедшую дату.
// document.cookie = "username=Salmanzade; path=/;"
// document.cookie = "username=Rovshan; expires=sun, 04 Jul 2008 15:45:59 UTC;"